In [43]:
import numpy as np
import pandas as pd

Handling categorical data

In [44]:
df=pd.DataFrame({
    'Color':['Red','Blue','Green','Red','Green']
})

In [45]:
df

   Color
0    Red
1   Blue
2  Green
3    Red
4  Green

In [46]:
df.dtypes

Color    object
dtype: object

In [47]:
df['Color']=df['Color'].astype('category')

In [48]:
df

   Color
0    Red
1   Blue
2  Green
3    Red
4  Green

In [49]:
df.dtypes

Color    category
dtype: object

In [50]:
sizes=pd.Categorical(['S','M','L','S','M','M','S','L'],categories=['S','M','L'],ordered=True)

sizes

['S', 'M', 'L', 'S', 'M', 'M', 'S', 'L']
Categories (3, object): ['S' < 'M' < 'L']

In [51]:
df_grades=pd.DataFrame({'Grade':['A','B','A','C','B','A']})

In [52]:
df_grades.value_counts()

Grade
A        3
B        2
C        1
Name: count, dtype: int64

In [53]:
df_grades['Grade']=df_grades['Grade'].astype('category')

In [54]:
df_grades.dtypes

Grade    category
dtype: object

In [55]:
df_grades['Grade'].value_counts()

Grade
A    3
B    2
C    1
Name: count, dtype: int64

In [56]:
df=pd.DataFrame({
    'City':['Delhi','Mumbai','Delhi','Mumbai','Delhi'],
    'sales':[200,150,300,400,250]
})

In [57]:
df

     City  sales
0   Delhi    200
1  Mumbai    150
2   Delhi    300
3  Mumbai    400
4   Delhi    250

In [58]:
df=pd.DataFrame({
    'Sizes':['M','S','L','M'],
    "Item":['shirt','pants','shirt','cap']
})

In [59]:
df

  Sizes   Item
0     M  shirt
1     S  pants
2     L  shirt
3     M    cap

In [60]:
df['sizes']=pd.Categorical(df['Sizes'],categories=['S','M','L'],ordered=True)

In [61]:
df

  Sizes   Item sizes
0     M  shirt     M
1     S  pants     S
2     L  shirt     L
3     M    cap     M

In [62]:
df.sort_values (by='Sizes')

  Sizes   Item sizes
2     L  shirt     L
0     M  shirt     M
3     M    cap     M
1     S  pants     S

In [63]:
df

  Sizes   Item sizes
0     M  shirt     M
1     S  pants     S
2     L  shirt     L
3     M    cap     M

In [64]:
df['sizes']>'M'

0    False
1    False
2     True
3    False
Name: sizes, dtype: bool

In [65]:
df[df['sizes']>'M']

  Sizes   Item sizes
2     L  shirt     L

In [66]:
df['is_large']=df['sizes']>'M'

In [67]:
df

  Sizes   Item sizes  is_large
0     M  shirt     M     False
1     S  pants     S     False
2     L  shirt     L      True
3     M    cap     M     False

In [68]:
df[df['sizes']>'M']

  Sizes   Item sizes  is_large
2     L  shirt     L      True

In [69]:
df

  Sizes   Item sizes  is_large
0     M  shirt     M     False
1     S  pants     S     False
2     L  shirt     L      True
3     M    cap     M     False

In [70]:
df[df['sizes']>'M']

  Sizes   Item sizes  is_large
2     L  shirt     L      True

In [71]:
df[df['sizes']>'S']

  Sizes   Item sizes  is_large
0     M  shirt     M     False
2     L  shirt     L      True
3     M    cap     M     False

In [72]:
df[df['sizes']=='S']

  Sizes   Item sizes  is_large
1     S  pants     S     False

In [73]:
df

  Sizes   Item sizes  is_large
0     M  shirt     M     False
1     S  pants     S     False
2     L  shirt     L      True
3     M    cap     M     False

In [74]:
ndf=df['sizes'].cat.rename_categories({'S':'Small','M':'Medium','L':'Large'})

In [75]:
ndf

0    Medium
1     Small
2     Large
3    Medium
Name: sizes, dtype: category
Categories (3, object): ['Small' < 'Medium' < 'Large']

In [80]:
employees=pd.DataFrame({
    'Name':['Alice','Bob','Charlie','David','Eve','Frank','Grace','Hannah','Ian','Jack',
            'Karen','Liam','Mona','Nina','Oscar'],
    'Gender':['Female','Male','Male','Male','Female','Male','Female','Female','Male','Male','Female','Male','Female','Female','Male'],
    'Age':[25,30,35,28,40,45,32,29,38,50,27,33,31,26,42],
    'Salary':[50000,60000,70000,55000,80000,90000,65000,58000,75000,10000,52000,67000,63000,54000,85000],
    'Role':['Engineer','Manager','Analyst','Engineer','Director','Manager','Analyst','Engineer','Director','Manager','Analyst','Engineer','Manager','Analyst','Director'],
})

employees

       Name  Gender  Age  Salary      Role
0     Alice  Female   25   50000  Engineer
1       Bob    Male   30   60000   Manager
2   Charlie    Male   35   70000   Analyst
3     David    Male   28   55000  Engineer
4       Eve  Female   40   80000  Director
5     Frank    Male   45   90000   Manager
6     Grace  Female   32   65000   Analyst
7    Hannah  Female   29   58000  Engineer
8       Ian    Male   38   75000  Director
9      Jack    Male   50   10000   Manager
10    Karen  Female   27   52000   Analyst
11     Liam    Male   33   67000  Engineer
12     Mona  Female   31   63000   Manager
13     Nina  Female   26   54000   Analyst
14    Oscar    Male   42   85000  Director

In [81]:
pd.get_dummies(employees, columns=['Gender'])

       Name  Age  Salary      Role  Gender_Female  Gender_Male
0     Alice   25   50000  Engineer           True        False
1       Bob   30   60000   Manager          False         True
2   Charlie   35   70000   Analyst          False         True
3     David   28   55000  Engineer          False         True
4       Eve   40   80000  Director           True        False
5     Frank   45   90000   Manager          False         True
6     Grace   32   65000   Analyst           True        False
7    Hannah   29   58000  Engineer           True        False
8       Ian   38   75000  Director          False         True
9      Jack   50   10000   Manager          False         True
10    Karen   27   52000   Analyst           True        False
11     Liam   33   67000  Engineer          False         True
12     Mona   31   63000   Manager           True        False
13     Nina   26   54000   Analyst           True        False
14    Oscar   42   85000  Director          False         True